# ایمان حبیبی - 40419383
# تمرینات فصل اول ، صفحه 26 ، سوال 1
# برنامه ای که n عدد را به عنوان ورودی دریافت کنید تعداد اعداد اول و اعداد کامل را نمایش دهد.
# استاد ابتدا تعداد اعداد و بعد خود اعداد را به ترتیب وارد کنید تا برنامه اجرا شود.
n = int(input( "تعداد اعداد ورودی را وارد کنید : "))
a = 0
b = 0
j=0
while j<n :
    x = int(input("عدد مورد نظر را وارد کنید تا بررسی شود : "))
    i = 2
    while x>i :
          r = x%i
          if r == 0:
              break
          i+=1
    if x == i :
              a+=1
    k=1
    sum = 0
    while x>k:
          r = x%k
          if r == 0:
              sum += k
          k+=1
    if x == sum or x == 1:
        b +=1
    j+=1
print ( "تعداد اعداد اول برابر است با : " , a )
print ("تعداد اعداد کامل برابر است با :" , b )