# ایمان حبیبی - 40419383
# تمرینات فصل اول ، صفحه 26 ، سوال 2
# برنامه ای بنویسید که x و n را به عنوان عدد ورودی دریافت کند و مفدار سری زیر را حساب کند.
# S = 1 + x2/2! + x4/4! + ... + xn/n!
x = int(input("مقدار x مورد نظر را وارد کنید :"))
n = int(input("مقدار n مورد نظر را وارد کنید ، توجه داشته باشید که عدد وارد شده زوج باشد :"))
i = 2
S = 1
fact = 1
if n % 2 == 0:
    while n >= i :
        a = (x**i)
        fact = fact * i * (i-1)
        b = a/fact
        i += 2
        S += b
    print(S)
else :
    print (" error ")
