# ایمان حبیبی - 40419383
# تمرینات فصل اول ، صفحه 26 ، سوال 4
# تاریخ تولد شخص را از ورودی خوانده و سن او را با تاریخ امروز محاسبه کند.
d = int(input("روز تولد شخص مورد نظر را وارد کنید : " ))
m = int(input("ماه تولد شخص مورد نظر را وارد کنید : "))
y = int(input("سال تولد شخص مورد نظر را وارد کنید : "))
# این کد متناسب با تاریخ 19 دی ماه مقایسه می شود.
D = 19
M = 10
Y = 1404
if d <= D:
    A = D-d
else :
    A = D+31-d
    M=M-1
if m <= M :
    B= M - m
else :
    B= M+12-m
    Y=Y-1
C = Y - y

print ( C , "/" , B , "/" , A )



