# ایمان حبیبی - 40419383
# تمرینات فصل اول ، صفحه 24 ، سوال 3
# دو عدد را دریافت کرده و بزرگترین مقسوم علیه مشترک انها را چاپ کند.
a = int(input("عدد اول را وارد کنید : "))
b = int(input("عدد دوم را وارد کنید : "))

if a > b :
    G = a
    S = b
    while 1==1 :
        if G % b == 0 and S % b == 0:
            print("ب.م.م دو عدد برابر است با : " , b)
            break
        else :
            b = b-1
else :
    G = b
    S=a
    while 1==1 :
        if G % a == 0 and S%a==0:
            print ("ب.م.م دو عدد برابر است با :" , a)
            break
        else :
            a = a-1