# ایمان حبیبی - 40419383
# تمرینات فصل اول ، صفحه 19 ، سوال 3
# ضرایب یک معادله ی درجه دوم را از ورودی دریافت کرده و ریشه های ان را در خروجی چاپ کند.
a = float(input("ضریب جمله ی توان دار را وارد کنید : "))
b = float(input( "ضریب جمله ی بدون توان را وارد کنید :"))
c = float(input("ضریب جمله ی بدون متغیر را وارد کنید : "))
D = (b**2) - (4*a*c)
if D >0:
     x1 = (-b + D)/(2*a)
     x2 = (-b - D)/(2*a)
     print(x1,x2)
elif D <0:
    print ( "Error")
else :
    x= (-b)/(2*a)
    print (x)